app/controllers/account_activations_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "bkohler4@gmail.com\">Activate"], ["LIMIT", 1]]
UPDATE "users" SET "activated" = 't', "activated_at" = '2017-10-04 21:39:59.176855' WHERE "users"."id" = ?  [["id", 102]]
---
  def edit
    user = User.find_by(email: params[:email])
    ## person question? activated vs authenticated?
    if user && !user.activated? && user.authenticated?(:activation, params[:id])
      user.update_attribute(:activated,   true)